var vars = {
	1: {
		title: 'Основні поняття',
		test: {
			1: {
				right: 2,
				title: 'Який з рядків не входить до алфавіту мови С?',
				answers: {
					1: 'A, k, 4,*, (, <',
					2: 'R, r, $, ж, 12',
					3: '6, N, s, 3, &'
				},
				where: 'Глинський, ст.4'
			},
			2: {
				right: 3,
				title: 'Яке з цих слів не є ключовим?',
				answers: {
					1: 'int',
					2: 'else',
					3: 'main'
				},
				where: 'Глинський, ст.4'
			},
			3: {
				right: 1,
				title: 'Яку функцію виконує препроцесор?',
				answers: {
					1: 'Опрацьовує директиви',
					2: 'Опрацьовує ключові слова',
					3: 'Опрацьовує заголовки'
				},
				where: 'Глинський, ст.5'
			},
			4: {
				right: 3,
				title: 'Яким символом починаються директиви мови С?',
				answers: {
					1: '&lt;',
					2: '\\',
					3: '#'
				},
				where: 'Глинський, ст.5'
			},
			5: {
				right: 3,
				title: 'Як виглядає функція, що повертає значення цілого типу?',
				answers: {
					1: 'main()',
					2: 'void main()',
					3: 'int main()'
				},
				where: 'Глинський, ст.7'
			},
			6: {
				right: 2,
				title: 'Виберіть неправильний коментар.',
				answers: {
					1: '/* текст коментарю*/',
					2: '/* текст коментарю',
					3: '//текст коментарю'
				},
				where: 'Глинський, ст.7'
			},
			7: {
				right: 2,
				title: 'В якому випадку команда return не пишеться?',
				answers: {
					1: 'int main()',
					2: 'void main()'
				},
				where: 'Глинський, ст.7'
			},
			8: {
				right: 3,
				title: 'Які властивості мають змінні і сталі?',
				answers: {
					1: 'ім’я, тип',
					2: 'ім’я, значення',
					3: 'ім’я, значення, тип'
				},
				where: 'Глинський, ст.8'
			},
			9: {
				right: 2,
				title: 'Виберіть правильне оголошення сталої.',
				answers: {
					1: 'const g := 40',
					2: 'const float g = 2.5',
					3: 'const g = 4.8'
				},
				where: 'Глинський, ст.9'
			},
			10: {
				right: 2,
				title: 'Виберіть правильне оголошення змінної.',
				answers: {
					1: 'int a; f; j;',
					2: 'float a = 4;',
					3: 'int d = 5.6;'
				},
				where: 'Глинський, ст.9'
			}
		}
	},
	2: {
		title: 'Типи даних',
		test: {
			1: {
				right: 3,
				title: 'Виберіть правильне оголошення команди, що визначає обсяг пам’яті типу.',
				answers: {
					1: 'sizeon(<назва типу>)',
					2: 'sizeof(назва типу)',
					3: 'sizeof(<назва типу>)'
				},
				where: 'Глинський, ст.10'
			},
			2: {
				right: 3,
				title: 'Виберіть правильний обсяг пам’яті цілого типу int.',
				answers: {
					1: '2 байти',
					2: '4 байти',
					3: '2 або 4 байт'
				},
				where: 'Глинський, ст.10'
			},
			3: {
				right: 2,
				title: 'Виберіть неправильну назву типу.',
				answers: {
					1: 'short int',
					2: 'short double',
					3: 'long int'
				},
				where: 'Глинський, ст.10-11'
			},
			4: {
				right: 3,
				title: 'Виберіть правильний обсяг пам’яті дійсного типу float.',
				answers: {
					1: '4 або 8 байт',
					2: '4 байти',
					3: '8 байт'
				},
				where: 'Глинський, ст.11'
			},
			5: {
				right: 2,
				title: 'Назвіть число різновидів назв цілого типу.',
				answers: {
					1: '3',
					2: '5',
					3: '6'
				},
				where: 'Глинський, ст.10'
			},
			6: {
				right: 3,
				title: 'Виберіть правильний обсяг пам’яті дійсного типу long double.',
				answers: {
					1: '8',
					2: '12',
					3: '10'
				},
				where: 'Глинський, ст.11'
			},
			7: {
				right: 2,
				title: 'Яке з оголошень є помилковим?',
				answers: {
					1: 'const int a = 45;',
					2: 'short int b = 89675;',
					3: 'long int g = 125436574;'
				},
				where: 'Глинський, ст.10-11'
			},
			8: {
				right: 3,
				title: 'Виберіть помилкове надання значення типу.',
				answers: {
					1: 'char f = ‘A’;',
					2: 'char name[20];',
					3: 'char d = “B”;'
				},
				where: 'Глинський, ст.12'
			},
			9: {
				right: 2,
				title: 'Якими значеннями даних характеризується логічний тип?',
				answers: {
					1: 'yes, no',
					2: 'false, true',
					3: 'in, out'
				},
				where: 'Глинський, ст.12'
			},
			10: {
				right: 3,
				title: 'За допомогою якої команди можна створити тип користувача?',
				answers: {
					1: '#include',
					2: 'typename',
					3: 'typedef'
				},
				where: 'Глинський, ст.12'
			}
		}
	},
	3: {
		title: 'Присвоєння',
		test: {
			1: {
				right: 3,
				title: 'Виберіть правильний запис команди присвоєння.',
				answers: {
					1: '<вираз> = <назва змінної>',
					2: '<назва змінної> = <назва змінної>',
					3: '<назва змінної> = <вираз>'
				},
				where: 'Глинський, ст.14'
			},
			2: {
				right: 1,
				title: 'Які бувають узгодження типів?',
				answers: {
					1: 'явне',
					2: 'уявне',
					3: 'виявлене'
				},
				where: 'Глинський, ст.14'
			},
			3: {
				right: 2,
				title: 'Яке число отримаємо з формули b=(int)c*a, коли с=3.8 і а=2 при явному перетворенні типів?',
				answers: {
					1: '7.6',
					2: '6',
					3: '8'
				},
				where: 'Глинський, ст.15'
			},
			4: {
				right: 2,
				title: 'Яке число отримаємо з формули b=(int)(c*a), коли с=3.8 і а=2 при явному перетворенні типів?',
				answers: {
					1: '6',
					2: '7',
					3: '7.6'
				},
				where: 'Глинський, ст.15'
			},
			5: {
				right: 2,
				title: 'Який рядок пріоритетів типів, від більшого до меншого, послідовний?',
				answers: {
					1: 'long, double, float, int, short',
					2: 'double, float, long, int, short',
					3: 'float, long, double, int, short'
				},
				where: 'Глинський, ст.15'
			}
		}
	},
	4: {
		title: 'Вирази',
		test: {
			1: {
				right: 3,
				title: 'Яка з команд не є арифметичною?',
				answers: {
					1: '*',
					2: '%',
					3: '++'
				},
				where: 'Глинський, ст.16'
			},
			2: {
				right: 3,
				title: 'Який з виразів записаний у постфіксній формі операції декркменту?',
				answers: {
					1: '<змінна>++',
					2: '--<змінна>',
					3: '<змінна>--'
				},
				where: 'Глинський, ст.16'
			},
			3: {
				right: 1,
				title: 'Що означає такий вираз: а += 10?',
				answers: {
					1: 'а = а + 10',
					2: 'а + 0 = 10',
					3: 'а + а = 10'
				},
				where: 'Глинський, ст.17-18'
			},
			4: {
				right: 1,
				title: 'Що виконує дана функція: abs(x)?',
				answers: {
					1: 'модуль х',
					2: 'х в квадраті',
					3: 'корінь з х'
				},
				where: 'Глинський, ст.18'
			},
			5: {
				right: 3,
				title: 'Які з функцій мають тип аргументу int?',
				answers: {
					1: 'pow10(x), exp(x)',
					2: 'exp(x), abs(x)',
					3: 'abs(x), pow10(x)'
				},
				where: 'Глинський, ст.18'
			},
			6: {
				right: 2,
				title: 'В якій бібліотеці описані математичні функції?',
				answers: {
					1: '<conio.h>',
					2: '<math.h>',
					3: '<iostream.h>'
				},
				where: 'Глинський, ст.18'
			}
		}
	},
	5: {
		title: 'Потоки. Введення – виведення даних',
		test: {
			1: {
				right: 1,
				title: 'У якому модулі описані команди виведення?',
				answers: {
					1: 'iostream.h',
					2: 'ostream.h',
					3: 'istream.h'
				},
				where: 'Глинський, ст.20'
			},
			2: {
				right: 2,
				title: 'Що є стандартиним потоком виведення повідомлення про помилки?',
				answers: {
					1: 'cout',
					2: 'cerr',
					3: 'clog'
				},
				where: 'Глинський, ст.20'
			},
			3: {
				right: 3,
				title: 'Який загальний вигляд має команда введення?',
				answers: {
					1: 'cin',
					2: '>>',
					3: 'cin>> <змінна>'
				},
				where: 'Глинський, ст.21'
			},
			4: {
				right: 2,
				title: 'Як виглядає команда виведення?',
				answers: {
					1: 'cout',
					2: '<<',
					3: 'cout<< <змінна>'
				},
				where: 'Глинський, ст.22'
			},
			5: {
				right: 3,
				title: 'Що означає така керуюча послідовність: \\n?',
				answers: {
					1: 'Перейти на нову сторінку',
					2: 'Подати звуковий сигнал',
					3: 'Перейти на новий рядок'
				},
				where: 'Глинський, ст.23'
			},
			6: {
				right: 3,
				title: 'Який із керуючих символів подає звуковий сигнал?',
				answers: {
					1: '\\a',
					2: '\\v',
					3: '\\7'
				},
				where: 'Глинський, ст.23'
			}
		}
	},
	6: {
		title: 'Адреси даних. Вказівники. Динамічна пам’ять',
		test: {
			1: {
				right: 3,
				title: 'Як виглядає операція визначення адреси?',
				answers: {
					1: '%<назва даного>',
					2: '&<адреса даного>',
					3: '&<назва даного>'
				},
				where: 'Глинський, ст.26'
			},
			2: {
				right: 2,
				title: 'Що є значенням змінної вказівника?',
				answers: {
					1: 'тип даного',
					2: 'адреса змінної',
					3: 'назва змінної'
				},
				where: 'Глинський, ст.27'
			},
			3: {
				right: 1,
				title: 'За допомогою якої конструкції можна отримати вміст комірки, на яку вказує вказівник?',
				answers: {
					1: '*<вказівник>',
					2: '*<назва змінної>',
					3: '&<вказівник>'
				},
				where: 'Глинський, ст.27'
			},
			4: {
				right: 2,
				title: 'Яка з операцій використовується для визначення к-сті елементів, які наявні між двома вказівниками?',
				answers: {
					1: 'vk1 == vk2',
					2: 'vk1 – vk2',
					3: 'vk1 + k  або vk1 - k'
				},
				where: 'Глинський, ст.28'
			},
			5: {
				right: 2,
				title: 'Яка з операцій використовується для визначення к-сті елементів, які наявні між двома вказівниками?',
				answers: {
					1: 'enum',
					2: 'new',
					3: 'delete'
				},
				where: 'Глинський, ст.28-29'
			},
			6: {
				right: 2,
				title: 'За допомогою якої команди вивільнюється пам’ять?',
				answers: {
					1: 'throw',
					2: 'delete',
					3: 'enum'
				},
				where: 'Глинський, ст.28-29'
			},
			7: {
				right: 1,
				title: 'Виберіть правильний варіант занулення вказівника.',
				answers: {
					1: '<назва вказівника> = NULL',
					2: 'NULL >> <назва вказівника>',
					3: 'NULL =  <назва вказівника>'
				},
				where: 'Глинський, ст.29'
			}
		}
	},
	7: {
		title: 'Файли',
		test: {
			1: {
				right: 3,
				title: 'В якій бібліотеці збурігаються функції для роботи з файлами?',
				answers: {
					1: 'iostream.h',
					2: 'ifstream.h',
					3: 'fstream.h'
				},
				where: 'Глинський, ст.31'
			},
			2: {
				right: 1,
				title: 'За допомогою якої команди можна зчитати дані з файлу?',
				answers: {
					1: '<назва ф. змінної> >> <змінна>',
					2: '<назва ф. змінної> << <змінна>',
					3: '<змінна> >> <назва ф. змінної>'
				},
				where: 'Глинський, ст.33'
			},
			3: {
				right: 2,
				title: 'За допомогою якої команди можна записати дані у файл?',
				answers: {
					1: '<змінна> << <назва ф. змінної>',
					2: '<назва ф. змінної> << <змінна>',
					3: '<назва ф. змінної> >> <змінна>'
				},
				where: 'Глинський, ст.33'
			},
			4: {
				right: 3,
				title: 'Яка ознака відкриває файл для читання з нього інформації? (Вміст файлу зберігається)',
				answers: {
					1: 'ios::out',
					2: 'ios::app',
					3: 'ios::in'
				},
				where: 'Глинський, ст.33-34'
			},
			5: {
				right: 2,
				title: 'Яке призначення ознаки ios::nocreate?',
				answers: {
					1: 'Забороняє перезаписати існуючий файл',
					2: 'Забороняє створювати файл, який відкривають',
					3: 'Дозволяє перезаписувати існуючий файл'
				},
				where: 'Глинський, ст.34'
			}
		}
	},
	8: {
		title: 'Розгалуження',
		test: {
			1: {
				right: 2,
				title: 'У складеній команді символ «;» ставиться обов’язково...',
				answers: {
					1: 'перед відкриваючою дужкою ',
					2: 'перез закриваючою дужкою ',
					3: 'після закриваючої дужки'
				},
				where: 'Глинський, ст.35'
			},
			2: {
				right: 2,
				title: 'Крму як команду використовують при інтерпритації …',
				answers: {
					1: 'декількох виразів',
					2: 'декількох команд',
					3: 'команд і виразів'
				},
				where: 'Глинський, ст.36'
			},
			3: {
				right: 3,
				title: 'До якого виду логічних операцій належить вираз true && true?',
				answers: {
					1: 'простий',
					2: 'складний',
					3: 'складений'
				},
				where: 'Глинський, ст.36'
			},
			4: {
				right: 3,
				title: 'Який з виразів не відповідає значенню false?',
				answers: {
					1: 'true && false',
					2: 'false && true',
					3: 'true && true'
				},
				where: 'Глинський, ст.37'
			},
			5: {
				right: 1,
				title: 'Який з виразів не відповідає значенню true?',
				answers: {
					1: '! true',
					2: '! false',
					3: 'false || true'
				},
				where: 'Глинський, ст.37'
			},
			6: {
				right: 1,
				title: 'Виберіть правильний результат команди: b = b << 2, при b = 00100101',
				answers: {
					1: '10010100',
					2: '00001001',
					3: '01001010'
				},
				where: 'Глинський, ст.38'
			},
			7: {
				right: 1,
				title: 'Що відбувається при зсуві цілого числа на n позицій вліво?',
				answers: {
					1: 'множення цього числа на 2n',
					2: 'ділення цього числа на 2n',
					3: 'додавання до цього числа 2n'
				},
				where: 'Глинський, ст.38'
			},
			8: {
				right: 2,
				title: 'Яка з операцій належить до команд присвоєння з побітовим зсувом?',
				answers: {
					1: '&=',
					2: '>>=',
					3: '<<+'
				},
				where: 'Глинський, ст.38'
			},
			9: {
				right: 1,
				title: 'Виберіть правильний вигляд короткої команди розгалуження if.',
				answers: {
					1: 'if(<лог. вираз>) <команда1>',
					2: 'if(<команда1>) <лог.вираз>',
					3: 'if <логічний вираз>, <команда>'
				},
				where: 'Глинський, ст.39'
			},
			10: {
				right: 2,
				title: 'Яка з команд, що входять до команди вибору (switch) є обов’язковою?',
				answers: {
					1: 'default',
					2: 'case',
					3: 'break'
				},
				where: 'Глинський, ст.40-41'
			}
		}
	},
	9: {
		title: 'Цикли',
		test: {
			1: {
				right: 1,
				title: 'Яка з команд означає процес виконання певного набору команд деяку кількість разів?',
				answers: {
					1: 'for',
					2: 'while',
					3: 'do-while'
				},
				where: 'Глинський, ст.45'
			},
			2: {
				right: 2,
				title: 'Які з команд не доцільно використовувати у циклах?',
				answers: {
					1: 'break',
					2: 'default',
					3: 'continue'
				},
				where: 'Глинський, ст.46'
			},
			3: {
				right: 3,
				title: 'Яка з особливостей не притаманна циклу while?',
				answers: {
					1: 'може виконуватись або не виконуватись',
					2: 'виконується декілька разів',
					3: 'виконується завжди'
				},
				where: 'Глинський, ст.48'
			},
			4: {
				right: 1,
				title: 'Команда 1 циклу do <команда1>; while (< вираз>); ...',
				answers: {
					1: 'виконується хоча б один раз',
					2: 'не виконується',
					3: 'може виконуватись, а може ні'
				},
				where: 'Глинський, ст.50'
			}
		}
	},
	10: {
		title: 'Функції (1)',
		test: {
			1: {
				right: 3,
				title: 'Яка із залежностей функцій неможлива?',
				answers: {
					1: 'від двох змінних різних типів',
					2: 'від багатьох змінних одного типу',
					3: 'не залежить ні від чого'
				},
				where: 'Глинський, ст.54'
			},
			2: {
				right: 3,
				title: 'Опис функції користувача складається з …',
				answers: {
					1: 'назви функції і тіла функції',
					2: 'типу функції і тіла функції',
					3: 'типу функції і назви функції'
				},
				where: 'Глинський, ст.54'
			},
			3: {
				right: 2,
				title: 'У тілі функції записуються …',
				answers: {
					1: 'назви та типи змінних',
					2: 'команди, які задають дію функції',
					3: 'команди, які не відносяться до функції'
				},
				where: 'Глинський, ст.55'
			},
			4: {
				right: 1,
				title: 'Виберіть правильний вигляд посилання.',
				answers: {
					1: '<тип даного> & <назва посилання> = <назва змінної>',
					2: '<тип даного> & <назва змінної> = <назва посилання>',
					3: '<назва змінної> >> <назва посилання>'
				},
				where: 'Глинський, ст.57'
			},
			5: {
				right: 1,
				title: 'Коли ініціалізується посилання?',
				answers: {
					1: 'відразу, під час оголошення',
					2: 'в ході використання посилання',
					3: 'не ініціалізується'
				},
				where: 'Глинський, ст.57'
			},
			6: {
				right: 3,
				title: 'Яке з призначень функції посилання не є істинним?',
				answers: {
					1: 'повертає значення в основну програму',
					2: 'сама може приймати значення',
					3: 'ніколи не змінює основних значень'
				},
				where: 'Глинський, ст.58'
			},
			7: {
				right: 1,
				title: 'Які команди може заміщувати рекурсія?',
				answers: {
					1: 'циклу',
					2: 'безумовного переходу',
					3: 'розгалуження'
				},
				where: 'Глинський, ст.59'
			}
		}
	},
	11: {
		title: 'Функції (2)',
		test: {
			1: {
				right: 2,
				title: 'Яка з областей змінної не існує?',
				answers: {
					1: 'обл. дії',
					2: 'обл. доступності',
					3: 'обл. видимості'
				},
				where: 'Глинський, ст.61'
			},
			2: {
				right: 2,
				title: 'Яка область дії локальної змінної?',
				answers: {
					1: 'вся програма',
					2: 'відповідна функція чи блок'
				},
				where: 'Глинський, ст.61'
			},
			3: {
				right: 1,
				title: 'Яка область дії глобальної функції?',
				answers: {
					1: 'вся програма',
					2: 'відповідна функція чи блок'
				},
				where: 'Глинський, ст.62'
			},
			4: {
				right: 1,
				title: 'Час дії змінної якого класу є тимчасовим?',
				answers: {
					1: 'auto',
					2: 'extern',
					3: 'static'
				},
				where: 'Глинський, ст.63'
			},
			5: {
				right: 3,
				title: 'Коли виникає поліморфізм?',
				answers: {
					1: 'при виклику функцій з аргументами різних типів',
					2: 'функція залежить від різної кількості аргументів',
					3: 'і те, і інше'
				},
				where: 'Глинський, ст.65'
			},
			6: {
				right: 1,
				title: 'Яка команда записується в шаблоні функції?',
				answers: {
					1: 'template',
					2: 'explicit',
					3: 'typedef'
				},
				where: 'Глинський, ст.67'
			},
			7: {
				right: 2,
				title: 'Яке ключове слово потрібно додати до оголошення, щоб створити вбудовану функцію?',
				answers: {
					1: 'class',
					2: 'inline',
					3: 'friend'
				},
				where: 'Глинський, ст.68'
			},
			8: {
				right: 3,
				title: 'Який з аргументів командного рядка не входить до функфії main?',
				answers: {
					1: 'int arg c',
					2: 'char *arhv',
					3: 'int *env[]'
				},
				where: 'Глинський, ст.69'
			}
		}
	},
	12: {
		title: 'Масиви',
		test: {
			1: {
				right: 1,
				title: 'Виберіть правильний вигляд конструкції одномірного масиву.',
				answers: {
					1: '<тип> <ім’я масиву> [<розмір>]',
					2: '<тип> [<розмір>] <ім’я масиву>',
					3: '<ім’я масиву> <тип>'
				},
				where: 'Глинський, ст.71'
			},
			2: {
				right: 3,
				title: 'На який елемент масиву вказує змінна stud[3]?',
				answers: {
					1: 'на третій',
					2: 'на другий',
					3: 'на четвертий'
				},
				where: 'Глинський, ст.72'
			},
			3: {
				right: 3,
				title: 'Яким із способів не можна проініціалізувати масив?',
				answers: {
					1: 'використовуючи ринцип замовчування',
					2: 'застосовуючи команду присвоєння',
					3: 'вводячи тільки цифри з клавіатури'
				},
				where: 'Глинський, ст.72'
			},
			4: {
				right: 1,
				title: 'Яка з команд не використовується при динамічному оголошенні масивів?',
				answers: {
					1: 'new',
					2: 'sizeof',
					3: 'default'
				},
				where: 'Глинський, ст.73'
			},
			5: {
				right: 1,
				title: 'Існує двовимірний масив цілих чисел int fsd[2][3] = {4,5,3,3,5,2}.Яке значення прийме елемент fsd[1][1]?',
				answers: {
					1: 'fsd[1][1] = 3',
					2: 'fsd[1][1] = 5',
					3: 'fsd[1][1] = 2'
				},
				where: 'Глинський, ст.79'
			},
			6: {
				right: 1,
				title: 'Виберіть правильний метод упорядкування масивів.',
				answers: {
					1: 'обміну',
					2: 'максимальних елементів',
					3: 'розриву'
				},
				where: 'Глинський, ст.81-83'
			}
		}
	},
	13: {
		title: 'Рядки',
		test: {
			1: {
				right: 1,
				title: 'Що є невід’ємним елементом рядка?',
				answers: {
					1: '‘\\0’',
					2: '‘/0’',
					3: '‘\\n’'
				},
				where: 'Глинський, ст.85'
			},
			2: {
				right: 1,
				title: 'Виберіть правильне оголошення масиву символів.',
				answers: {
					1: 'char <назва рядка> [довжина рядка]',
					2: 'int < назва рядка > [довжина рядка]',
					3: 'float < назва рядка > [довжина рядка]'
				},
				where: 'Глинський, ст.85'
			},
			3: {
				right: 2,
				title: 'В якій із біблоітек визначені стандартні функції введення-виведення рядків?',
				answers: {
					1: 'include.h',
					2: 'conio.h',
					3: 'math.h'
				},
				where: 'Глинський, ст.87'
			},
			4: {
				right: 3,
				title: 'Яку функцію виконує команда strcpy(r1, r2)?',
				answers: {
					1: 'з’єднує рядки r1, r2  в один рядк',
					2: 'копіює символи з рядка r1в r2',
					3: 'копіює символи з рядка r2в r1'
				},
				where: 'Глинський, ст.87'
			},
			5: {
				right: 2,
				title: 'Яка з команд визначає фактичну кількість символів у рядку?',
				answers: {
					1: 'strchr(<символ>)',
					2: 'strlen(<рядок>)',
					3: 'strtok(<r1, r2>)'
				},
				where: 'Глинський, ст.87'
			},
			6: {
				right: 3,
				title: 'Яка з функцій порівнює рядки з урахуванням ркгістра для латинського алфавіту?',
				answers: {
					1: 'stricmp(r1, r2)',
					2: 'strstr(r1, r2)',
					3: 'strcmp(r1, r2)'
				},
				where: 'Глинський, ст.89'
			}
		}
	},
	14: {
		title: 'Структури, списки, стеки, черги, об’єднання',
		test: {
			1: {
				right: 3,
				title: 'Структура складається з …',
				answers: {
					1: 'рядків',
					2: 'масивів',
					3: 'полів'
				},
				where: 'Глинський, ст.93'
			},
			2: {
				right: 3,
				title: 'Структура може містити типи даних …',
				answers: {
					1: 'char',
					2: 'char, float',
					3: 'різні'
				},
				where: 'Глинський, ст.93'
			},
			3: {
				right: 1,
				title: 'Виберіть правильний доступ до полів окремих елементів масиву.',
				answers: {
					1: '<назва елемента> [індекс].<назва поля>',
					2: '<назва поля> [індекс].<назва елемента>',
					3: '<назва структури> [індекс].<назва елемента>'
				},
				where: 'Глинський, ст.96'
			},
			4: {
				right: 3,
				title: 'Список може містити дані типу …',
				answers: {
					1: 'char',
					2: 'різні',
					3: 'одного'
				},
				where: 'Глинський, ст.97'
			},
			5: {
				right: 2,
				title: 'Що використовують для опису списку?',
				answers: {
					1: 'структура + розгалуження',
					2: 'структура + вказівник',
					3: 'рядок + вказівник'
				},
				where: 'Глинський, ст.97'
			},
			6: {
				right: 3,
				title: 'Який із наведених прикладів найбільш схожий на стек?',
				answers: {
					1: 'банка з піском',
					2: 'банка з водою',
					3: 'банка з яблуками'
				},
				where: 'Глинський, ст.101'
			},
			7: {
				right: 1,
				title: 'За яким принципом діє структура даних – черга?',
				answers: {
					1: 'перший прийшов – перший пішов',
					2: 'перший прийшов – останній пішов',
					3: 'перший прийшов – пішов будь-коли'
				},
				where: 'Глинський, ст.68'
			}
		}
	}
}